tickets/k8s/watch-events-tooling.org
#+TITLE: Watch events tooling
#+AUTHOR: Caleb Woodbine <caleb@ii.coop>
#+AUTHOR: Hippie Hacker <hh@ii.coop>

* Current problem

Watch events may be missed and the test may still pass.
We need to ensure that all expected watch events are seen.

Watch events are not collected and checked at the end of the test.

* Proposed solution

In order to solve the problem, we must collect all watch events as they come in and perform a check at the end of the test to ensure that the order is correct and they contain no errors.

#+begin_src go :wrap "example"
  package main

  import (
    "fmt"
  )

  func main () {
    var watchBox []string
    myWatchEvent := ""

    fmt.Println("An event takes place (1/3)")
    myWatchEvent = "ADDED"
    watchBox = append(watchBox, myWatchEvent)

    fmt.Println("An event takes place (2/3)")
    myWatchEvent = "MODIFIED"
    watchBox = append(watchBox, myWatchEvent)

    fmt.Println("An event takes place (3/3)")
    myWatchEvent = "DELETED"
    watchBox = append(watchBox, myWatchEvent)

    expectedWatchBox := []string{
     "ADDED",
     "MODIFIED",
     "MODIFIED",
     "DELETED",
    }
    failure := VerifyWatchEventOrder(expectedWatchBox, watchBox)
    if failure != "" {
      fmt.Println(failure, "watch events occured in the wrong or incorrect order")
      return
    }
  }

  func VerifyWatchEventOrder(expectedWatchEvents []string, actualWatchEvents []string) (failure string) {
    for watchEventInt, watchEvent := range actualWatchEvents {
      if expectedWatchEvents[watchEventInt] != watchEvent {
        failure = fmt.Sprintf("(index %v) %v not found, found %v instead", watchEventInt, expectedWatchEvents[watchEventInt], watchEvent)
        break
      }
    }
    return failure
  }
#+end_src

#+RESULTS:
#+begin_example
An event takes place (1/3)
An event takes place (2/3)
An event takes place (3/3)
(index 2) MODIFIED not found, found DELETED instead watch events occured in the wrong or incorrect order
#+end_example
